---
kind: property
id: P:Autodesk.Revit.DB.Category.IsValid
source: html/1fc87f11-8c59-2b1e-68d1-7f31f2bf6e1f.htm
---
# Autodesk.Revit.DB.Category.IsValid Property

Indicates if the Category is valid or not.

## Syntax (C#)
```csharp
public bool IsValid { get; }
```

## Remarks
A valid Category is one which is present in the Document's Categories.